Public Member Functions | Friends | List of all members
ACAPI::UI::Notification::NotificationBubbleManager Class Reference
Notifications Manager
A class that contains notification bubble related functions. More...
#include <NotificationBubbleManager.hpp>
 Inheritance diagram for ACAPI::UI::Notification::NotificationBubbleManager:
 Public Member Functions
void  | RegisterNotificationBubble (const API_Guid &guid) const
Registers a new Notification Bubble.
NotificationBubble  | CreateNotificationBubble (const API_Guid &guid) const
Creates a new Notification Bubble (if it is not registered yet, then registers it).
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
NotificationBubbleManager  | CreateNotificationBubbleManager ()
A function to create a notification bubble manager, which lets you create notification bubbles from API.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that contains notification bubble related functions.
Example code snippets from Notification Manager / Show notification bubble at local origo
 API_Coord3D localOrigo3D;
 if (auto getLocalOrigoResult = ACAPI_Database_GetLocOrigo (&localOrigo3D); getLocalOrigoResult != NoError) {
 ACAPI_WriteReport ("Failed to get Local Origo.", false);
 return;
 }
 API_Coord localOrigo;
 ACAPI_View_ModelToScreen (localOrigo3D, localOrigo);
 API_Point point;
 ACAPI_View_CoordToPoint (&localOrigo, &point);
 static constexpr const char* TestGuid = "255EACB7-197C-4176-B231-813D8F39AB29";
 auto notificationBubble = ACAPI::UI::Notification::CreateNotificationBubbleManager ().CreateNotificationBubble (APIGuidFromString (TestGuid));
 GS::UniString message = "This is a notification bubble at the local origo";
 notificationBubble.SetText (message);
 notificationBubble.SetIcon (DG::Icon (SysResModule, DG::Icon::Floppy));
 notificationBubble.SetTimeout (2000);
 notificationBubble.Show (point);
Since
Archicad 29
Member Function Documentation
◆ CreateNotificationBubble()
 NotificationBubble ACAPI::UI::Notification::NotificationBubbleManager::CreateNotificationBubble  |  ( |  const API_Guid & |  guid | ) |   const
Creates a new Notification Bubble (if it is not registered yet, then registers it).
Parameters
guid | Unique identifier for the Notification Bubble.
Returns
The new Notification Bubble.
◆ RegisterNotificationBubble()
 void ACAPI::UI::Notification::NotificationBubbleManager::RegisterNotificationBubble  |  ( |  const API_Guid & |  guid | ) |   const
Registers a new Notification Bubble.
Parameters
guid | Unique identifier for the Notification Bubble.
Remarks
You must call this function as early as possible, in the RegisterInterface function, if your notification bubble has redraw count limit. Otherwise, your notification bubble might not be affected correctly by the 'Enable all informational messages' menu command.
Friends And Related Symbol Documentation
◆ CreateNotificationBubbleManager
 NotificationBubbleManager CreateNotificationBubbleManager  |  ( |   | )
friend
A function to create a notification bubble manager, which lets you create notification bubbles from API.
Returns
The notification bubble manager.